# -*- coding: utf-8 -*-

"""
Модуль содержит предопределенные Reply-клавиатуры для использования в Telegram боте.
"""

# --------------------------------------------------------------------------
# Импорты
# --------------------------------------------------------------------------

from aiogram.types import ReplyKeyboardMarkup, KeyboardButton


# --------------------------------------------------------------------------
# Reply-клавиатуры
# --------------------------------------------------------------------------

location_keyboard = ReplyKeyboardMarkup(
    keyboard=[
        [KeyboardButton(text="📍 Поделиться геолокацией", request_location=True)] # Кнопка для запроса геолокации
    ],
    resize_keyboard=True, # Изменение размера клавиатуры под размер кнопок
    one_time_keyboard=True # Клавиатура скрывается после использования
)